---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationSpring
source: html/d19ab732-6b98-efcb-7782-c39c652c853f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationSpring Property

"X Translation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryXTranslationSpring { get; }
```